def main_menu():
	print('=' * 50)
	print('Варианты работы программы')
	print('-' * 50)
	print('1. Создание и удаление контакта')
	print('2. Вывод контактов')
	print('3. Импорт контактов')
	print('4. Выход из программы')


def export_menu():
	print('=' * 50)
	print('Варианты работы программы')
	print('-' * 50)
	print('1. Вывод всех данных')
	print('2. Вывод информации о контакте по указанным фамилии и имени')
	print('3. Вернуться в главное меню')
	print('4. Выход из программы')


def import_menu():
	print('=' * 50)
	print('Варианты работы программы')
	print('-' * 50)
	print('1. Импортировать в .csv (сохранить как...)')
	print('2. Вернуться в главное меню')
	print('3. Выход из программы')


def error():
	print('-' * 50)
	print('------ Ошибка -------')
	print('-' * 50)


def menu_contact_actions():
	print('=' * 50)
	print('Варианты работы программы')
	print('-' * 50)
	print('1. Создать контакт')
	print('2. Удалить контакт')
	print('3. Вернуться в главное меню')
	print('4. Выход из программы')


def exit_menu():
	print('=' * 50)
	print('Выберите дальнейшее действие')
	print('-' * 50)
	print('1. Выход в главное меню')
	print('2. Выход из программы')
    